{
  "sweets": [
    {
      "name": "Berry Bliss Cake",
      "description": "Hi there! Today, we’re going to make a delightful 'Berry Bliss Cake'. First, you’ll want to start by creaming together butter, sugar, and eggs until the mixture is smooth. Then, gently fold in the flour and baking powder, mixing just until combined. Now, it’s time to add the fresh berries – you can use strawberries, raspberries, or blueberries. Pour the batter into a greased baking pan and pop it into a preheated oven at 180°C (350°F) for about 45 minutes. While it bakes, the kitchen will smell wonderful! Once it’s done, let it cool for 20 minutes before slicing and serving. Enjoy your beautiful berry creation!",
      "time_minutes": 105,
      "image_url": "https://firebasestorage.googleapis.com/v0/b/chinese-fortune-tiger.appspot.com/o/a-vibrant--colorful-character-with-a-candy-theme--%20(1)%201.svg?alt=media&token=de57d1cc-fbb1-472f-b0c6-32c69dff00fa"
    },
    {
      "name": "Chocolate Drizzle Delight",
      "description": "Let's make a rich and indulgent 'Chocolate Drizzle Delight'! Start by melting your favorite dark chocolate in a double boiler until smooth. While it melts, mix together sugar, eggs, and a pinch of salt in a bowl. Slowly pour the melted chocolate into the mixture while stirring constantly. Sift in the flour and fold it in gently until just combined. Pour the batter into a lined baking tray and bake at 170°C (340°F) for about 30 minutes. When it's done, drizzle melted white chocolate over the top for a beautiful finish. Allow it to cool for 10 minutes, then slice and serve!",
      "time_minutes": 80,
      "image_url": "https://firebasestorage.googleapis.com/v0/b/chinese-fortune-tiger.appspot.com/o/a-vibrant--colorful-character-with-a-candy-theme--%20(1)%201.svg?alt=media&token=de57d1cc-fbb1-472f-b0c6-32c69dff00fa"
    },
    {
      "name": "Frosted Strawberry Layer",
      "description": "We’re making a dreamy 'Frosted Strawberry Layer' cake today! Begin by preparing two sponge cakes. In a large bowl, beat together butter, sugar, and eggs until fluffy. Gradually add in flour and baking powder, alternating with milk. Divide the batter evenly between two pans and bake at 180°C (350°F) for 25 minutes. While the cakes are cooling, prepare a strawberry cream by whipping heavy cream, sugar, and finely chopped strawberries. Once the cakes have cooled, spread the strawberry cream between the layers and frost the entire cake with more cream. Decorate with fresh strawberries on top!",
      "time_minutes": 95,
      "image_url": "https://firebasestorage.googleapis.com/v0/b/chinese-fortune-tiger.appspot.com/o/a-vibrant--colorful-character-with-a-candy-theme--%20(1)%201.svg?alt=media&token=de57d1cc-fbb1-472f-b0c6-32c69dff00fa"
    },
    {
      "name": "Creamy Caramel Cups",
      "description": "Today, we’re making smooth and creamy 'Creamy Caramel Cups'! Start by melting sugar in a saucepan over medium heat until it turns a deep amber color. Carefully add in butter and heavy cream, stirring constantly to make a rich caramel. Set aside to cool slightly. Next, mix together softened cream cheese and sugar until smooth. Pour the caramel over the cream cheese mixture and stir until combined. Spoon this filling into small tart shells and refrigerate for at least 30 minutes. Once they’ve set, sprinkle a little sea salt on top for a perfect sweet and salty treat!",
      "time_minutes": 70,
      "image_url": "https://firebasestorage.googleapis.com/v0/b/chinese-fortune-tiger.appspot.com/o/a-vibrant--colorful-character-with-a-candy-theme--%20(1)%201.svg?alt=media&token=de57d1cc-fbb1-472f-b0c6-32c69dff00fa"
    },
    {
      "name": "Lemon Meringue Tart",
      "description": "Ready for a zesty treat? Let’s make a 'Lemon Meringue Tart'! First, prepare a simple tart crust by mixing butter, flour, and sugar, then press it into a tart pan and bake until golden. While the crust cools, make the lemon curd by whisking together lemon juice, sugar, eggs, and butter in a saucepan over medium heat. Cook until thickened, then pour into the crust. Now, for the meringue: whip egg whites and sugar until stiff peaks form, then spread over the lemon curd. Bake the tart for an additional 10 minutes to toast the meringue. Let it cool before serving!",
      "time_minutes": 85,
      "image_url": "https://firebasestorage.googleapis.com/v0/b/chinese-fortune-tiger.appspot.com/o/a-vibrant--colorful-character-with-a-candy-theme--%20(1)%201.svg?alt=media&token=de57d1cc-fbb1-472f-b0c6-32c69dff00fa"
    }
  ]
}
